JournalEntry.throttleADP(AString)
Determines if the current ADP for the given key is currently being
throttled.
key: key to determine throttle for.
Returns: true if name is currently throttled (not reported), false if not being throttled.